[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:33
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (organization) => ({
-        url: "/api/ucsborganization/post",
-        method: "POST",
-        params: {
-          orgCode: organization.orgCode,
-          orgTranslationShort: organization.orgTranslationShort,
-          orgTranslation: organization.orgTranslation,
-          inactive: organization.inactive
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (organization) => {
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:52
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (organization) => ({
-        url: "/api/ucsborganization/post",
-        method: "POST",
-        params: {
-          orgCode: organization.orgCode,
-          orgTranslationShort: organization.orgTranslationShort,
-          orgTranslation: organization.orgTranslation,
-          inactive: organization.inactive
-        }
-    });
+    const objectToAxiosParams = (organization) => ({});
 
     const onSuccess = (organization) => {
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:10:14
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
     const objectToAxiosParams = (organization) => ({
-        url: "/api/ucsborganization/post",
+        url: "",
         method: "POST",
         params: {
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New organization Created - orgCode: ZPR orgTranslationShort: ZETA PHI RHO"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Axios Error: Error: Request failed with status code 404"
       3: "Error: Request failed with status code 404"

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:20:41
         }
     });
 
-    const onSuccess = (organization) => {
-        toast(`New organization Created - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}`);
-    }
+    const onSuccess = (organization) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New organization Created - orgCode: ZPR orgTranslationShort: ZETA PHI RHO"

Number of calls: 0

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:37:34
         mutation.mutate(data);
     }
 
-    if (isSuccess && !storybook) {
-        return <Navigate to="/organization" />
-    }
+    if (isSuccess && !storybook) {}
 
     return (
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/organization"}

Number of calls: 0
