[Killed] BlockStatement
src/main/utils/ucsbOrganizationUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/organizations",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.orgCode
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
killedBy: ucsbOrganizationUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": "ZPR"}, "url": "/api/organizations"}
Received: undefined

[Killed] StringLiteral
src/main/utils/ucsbOrganizationUtils.js:10:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/organizations",
+        url: "",
         method: "DELETE",
         params: {
killedBy: ucsbOrganizationUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {

[Killed] ObjectLiteral
src/main/utils/ucsbOrganizationUtils.js:12:17
     return {
         url: "/api/organizations",
         method: "DELETE",
-        params: {
-            id: cell.row.values.orgCode
-        }
+        params: {}
     }
 }
killedBy: ucsbOrganizationUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
    "method": "DELETE",
-   "params": Object {
