[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:13:34
   
       const currentUser = useCurrentUser();
     
-      const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/organizations/create"
-                    style={{ float: "right" }}
-                >
-                    Create UCSBOrganization 
-                </Button>
-            )
-        } 
-      }
+      const createButton = () => {}
       
       const { data: organizations, error: _error, status: _status } =
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBOrganization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:14:49
       const currentUser = useCurrentUser();
     
       const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/organizations/create"
-                    style={{ float: "right" }}
-                >
-                    Create UCSBOrganization 
-                </Button>
-            )
-        } 
+        if (hasRole(currentUser, "ROLE_ADMIN")) {} 
       }
       
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBOrganization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrayDeclaration
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:32:11
           // Stryker disable next-line all : don't test internal caching of React Query
           ["/api/ucsborganization/all"],
           { method: "GET", url: "/api/ucsborganization/all" },
-          []
+          ["Stryker was here"]
         );
     
killedBy: UCSBOrganizationIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode" role="cell" /> instead
