[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:99:45
                             isInvalid={Boolean(errors.station)}
                             {...register("station", {
                                 required: "Station is required.",
-                                maxLength : {
-                                    value: 50,
-                                    message: "Max length 50 characters"
-                                }
+                                maxLength : {}
                             })}
                         />
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 50 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
