[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:26:36
 
     console.log(organization, _error, _status)
 
-    const objectToAxiosPutParams = (organization) => ({
-        url: "/api/ucsborganization",
-        method: "PUT",
-        params: {
-            orgCode: organization.orgCode,
-        },
-        data: {
-            orgCode: organization.orgCode,
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (organization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization Updated - orgCode: ZPR orgTranslationShort: ZETA PHI RHOO"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:26:55
 
     console.log(organization, _error, _status)
 
-    const objectToAxiosPutParams = (organization) => ({
-        url: "/api/ucsborganization",
-        method: "PUT",
-        params: {
-            orgCode: organization.orgCode,
-        },
-        data: {
-            orgCode: organization.orgCode,
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive,
-        }
-    });
+    const objectToAxiosPutParams = (organization) => ({});
 
     const onSuccess = (organization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization Updated - orgCode: ZPR orgTranslationShort: ZETA PHI RHOO"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:27:14
     console.log(organization, _error, _status)
 
     const objectToAxiosPutParams = (organization) => ({
-        url: "/api/ucsborganization",
+        url: "",
         method: "PUT",
         params: {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization Updated - orgCode: ZPR orgTranslationShort: ZETA PHI RHOO"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:32:15
         params: {
             orgCode: organization.orgCode,
         },
-        data: {
-            orgCode: organization.orgCode,
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive,
-        }
+        data: {}
     });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"orgCode\":\"ZPR\",\"orgTranslationShort\":\"ZPR\",\"orgTranslation\":\"ZPR\",\"inactive\":\"true\"}"
Received: "{}"

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:66:21
             <div className="pt-2">
                 <h1>Edit UCSBOrganization</h1>
                 {
-                    organization && <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organization} />
+                    true
                 }
             </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
