[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:58:42
                             id="itemId"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.js:76:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'Date Reviewed should be ISO.'}
+                            {errors.dateReviewed || 'Date Reviewed should be ISO.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:76:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'Date Reviewed should be ISO.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed should be ISO./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.js:91:30
                             {...register("stars", { required: true, pattern: stars_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.stars && 'Stars should be 1-5.'}
+                            {errors.stars || 'Stars should be 1-5.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:91:30
                             {...register("stars", { required: true, pattern: stars_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.stars && 'Stars should be 1-5.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: Stars should be 1-5.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:106:59
                             id="reviewerEmail"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("reviewerEmail", {
-                                required: "Reviewer Email are required."
-                            })}
+                            {...register("reviewerEmail", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:126:42
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("comments", {
+                            {...register("", {
                                 required: "Comments are required."
                             })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
